Repository: ismaelpadilla/ciuy_py
Catalog: docs/locales/*/LC_MESSAGES/about.po
Languages: es

source: About Uruguayan id numbers
es: Acerca de los números de identidad uruguayos

source: In Uruguay, each person is issued an identity card, which contains all the necessary information to identify the owner unequivocally.
es: En Uruguay, a cada persona se le asigna un documento de identidad, el cual contiene toda la información necesaria para identificar a la persona inequívocamente.

source: This document is mandatory for all inhabitants Uruguay, whether they are native citizens, legal citizens, or resident aliens in the country, even for children as young as 45 days old.
es: Este documento es obligatorio para todos los habitantes de Uruguay, sean ciudadanos naturales y legales, o extranjeros residentes en el país, incluso para los niños a partir de los 45 días de nacidos.

source: Sample Uruguayan id card.
es: Ejemplo de documento de identidad uruguayo.

source: Each person is issued an identiy number (which is decided at birth for native citizens), which contains 7 digits and a validation number. Old identity number contain only 6 digits, and a validation number.
es: A cada persona se le asigna un número de identidad (el cual es determinado al momento de nacimiento para ciudadanos naturales), el cual contiene 7 dígitos y un dígito verificador. Los números de identidad antiguos contienen solo 6 dígitos, y un dígito verificador.

source: Calculating the validation number
es: Calculando el dígito verificador

source: Then, if the resulting number is ``n``\ , the validation digit will be ``n`` modulo 10.
es: Entonces, si el número resultantes es ``n``\ , el dígito verificador será ``n`` módulo 10.

source: Validating 6-digit numbers
es: Validando números de 6 dígitos

source: 6 digit numbers should be multiplied by ``<1, 2, 3, 4, 7, 6>``\ instead. Given ``n``\ , the resulting number, then the validation digit will be ``n`` modulo 10.
es: Los números de 6 dígitos deben ser multiplicados por ``<1, 2, 3, 4, 7, 6>``\ . Dado ``n``\ , el numero resultante, entonces el dígito verificador será ``n`` módulo 10.

source: An example
es: Un ejemplo

source: Validating 1.234.567:
es: Validando 1.234.567:

source: &<1, 2, 3, 4, 5, 6, 7> . <8, 1, 2, 3, 4, 7, 6> = \\ &\; 1*8 + 2*1 + 3*2 + 4*3 + 5*4 + 6*7 + 7*6 = 132\\ &\\ &132 \: modulo \: 10 = 2
es: &<1, 2, 3, 4, 5, 6, 7> . <8, 1, 2, 3, 4, 7, 6> = \\ &\; 1*8 + 2*1 + 3*2 + 4*3 + 5*4 + 6*7 + 7*6 = 132\\ &\\ &132 \: módulo \: 10 = 2

source: So the validation digit is ``2``\ . The id number would normally be written as 1.234.567-2.
es: Entonces el dígito verificador es ``2``\ . El número de identidad normalmente sería escrito como 1.234.567-8.
