Repository: ismaelpadilla/ciuy_py
Catalog: docs/locales/*/LC_MESSAGES/functions.po
Languages: es

source: Functions and examples
es: Funciones y ejemplos

source: Validates the document number passed as a paremeter.
es: Valida el número de documento pasado como parámetro.

source: Parameters
es: Parámetros

source: The document number to validate. Any non-digit characters are ignored. A number can be passed as a parameter as well.
es: Número de documento a ser validado. Los caracteres que no sean números son ignorados. También se puede pasar un número como parámetro.

source: Returns
es: Retorna

source: ``True`` if the document number is valid, ``False`` otherwise.
es: ``True`` si el número de documento es válido, ``False`` en caso contrario.

source: Return type
es: Tipo de retorno

source: Raises
es: Levanta

source: if ``ci``\ , without including the validation digit is lower than 100.000 or higher than 9.999.999.
es: si ``ci``\ , sin incluir el dígito verificador es menor que 100.000 o mayor que 9.999.999.

source: Returns the validation digit for a given document number.
es: Retorna el dígito de validación para un número de documento dado.

source: Returns a random document number, including validation digit. The document number is in the (100.000, 9.999.999) range.
es: Devuelve un número de documento aleatorio, incluido el dígito de validación. El número de documento está en el rango (100.000, 9.999.999).

source: A random valid document number.
es: Un número de documento válido aleatorio.
