Repository: ismaelpadilla/ciuy_py
Catalog: docs/locales/*/LC_MESSAGES/index.po
Languages: es

source: Home
es: Inicio

source: Contents:
es: Contenido:

source: Package for validating Uruguayan identity document numbers.
es: Paquete para validar números de documentos de identidad Uruguayos.

source: The functions in this package work with strings and ignore any non-digit characters. Numbers are valid too. So for example, the following expressions represent the same document number::
es: Las funciones en este paquete funcionan con strings e ignoran cualquier caracter que no sea un número. También se pueden usar números. Entonces por ejemplo, las siguientes expresiones representan el mismo número de documento::

source: Installation
es: Instalación

source: ``ciuy`` can be installed with :any:`pip<pip:index>`:
es: ``ciuy`` puede ser instalado con :any:`pip<pip:index>`:

source: Usage
es: Uso

source: See :doc:`/functions` for more detailed documentation of each function.
es: Ver :doc:`/functions` para información más detallada acerca de cada función.

source: This package includes some doctests, as well as unit tests that can be run with :any:`pytest<pytest:index>`.
es: Este paquete incluye algunos doctests, así como también tests unitarios que pueden ser ejecutados con :any:`pytest<pytest:index>`.

source: After cloning the repository, you can run the doctests with:
es: Luego de clonar el repositorio, puedes ejecutar los doctests con:

source: Use :any:`pytest<pytest:index>` to run the unit tests:
es: Usa :any:`pytest<pytest:index>` para ejecutar los tests unitarios:

source: You can also use :any:`pytest<pytest:index>` to run all tests, including doctests, with:
es: También es posible usar :any:`pytest<pytest:index>` para correr todos los tests, incluyendo los doctests, con:

source: Command line
es: Línea de comandos

source: After installation, the following commands become available:
es: Luego de la instalación, los siguientes comandos estarán disponibles:
